; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	thermograph4 - mode
	thermograph0 - mode
	thermograph3 - mode
	thermograph2 - mode
	image1 - mode
	Star0 - direction
	Star1 - direction
	GroundStation2 - direction
	Star3 - direction
	GroundStation5 - direction
	GroundStation6 - direction
	GroundStation7 - direction
	Star9 - direction
	GroundStation10 - direction
	GroundStation11 - direction
	GroundStation12 - direction
	Star4 - direction
	GroundStation13 - direction
	Star8 - direction
	Phenomenon14 - direction
	Planet15 - direction
	Star16 - direction
	Planet17 - direction
)
(:init
	(supports instrument0 thermograph2)
	(supports instrument0 image1)
	(supports instrument0 thermograph3)
	(supports instrument0 thermograph0)
	(supports instrument0 thermograph4)
	(calibration_target instrument0 Star8)
	(calibration_target instrument0 GroundStation13)
	(calibration_target instrument0 Star4)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation7)
)
(:goal (and
	(have_image Phenomenon14 thermograph2)
	(have_image Planet15 thermograph0)
	(have_image Star16 thermograph4)
	(have_image Planet17 thermograph3)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 4
2. (turn_to satellite0 phenomenon14 groundstation7)
   deleted: (pointing satellite0 groundstation7)
   added: (pointing satellite0 phenomenon14)
   goals met: 0 of 4
3. (turn_to satellite0 star8 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 star8)
   goals met: 0 of 4
4. (calibrate satellite0 instrument0 star8)
   added: (calibrated instrument0)
   goals met: 0 of 4
5. (turn_to satellite0 phenomenon14 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 phenomenon14)
   goals met: 0 of 4
6. (take_image satellite0 phenomenon14 instrument0 thermograph2)
   added: (have_image phenomenon14 thermograph2)
   goals met: 1 of 4
7. (turn_to satellite0 planet15 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 planet15)
   goals met: 1 of 4
8. (take_image satellite0 planet15 instrument0 thermograph0)
   added: (have_image planet15 thermograph0)
   goals met: 2 of 4
9. (turn_to satellite0 planet17 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 planet17)
   goals met: 2 of 4
10. (take_image satellite0 planet17 instrument0 thermograph3)
   added: (have_image planet17 thermograph3)
   goals met: 3 of 4
11. (turn_to satellite0 star16 planet17)
   deleted: (pointing satellite0 planet17)
   added: (pointing satellite0 star16)
   goals met: 3 of 4
12. (take_image satellite0 star16 instrument0 thermograph4)
   added: (have_image star16 thermograph4)
   goals met: 4 of 4
